%{
learning01.m
%}
%% 赋值
a = [1 2];
A = [1 3];
b = [1;2];
%% 运算符
B = a+A;
c = a-A;
C = a+b;% [a1+b1,a2+b1;a1+b2,a2+b2]
d = a * b;
% D = a * A;% 无法执行，因为维度不同
D = [1 2;3 4];
D0 = [1 2 3;...% ...-->分行
    4 5 6;...
    7 8 9];
e = D*D;% [1*1+2*3,1*2+2*4;3*1+4*3,3*2+4*4]
E = D^2;% 等效于e乘方
f = D';% D的转置
F = all([1 2 3].*[4 5 6] == [1*4 2*5 3*6]);% all(a  ==  b) 判断向量是否相等，若无all则对应第n个元素比较
g = all(all([1 2 3].*[4;5;6] == [1*4,2*4,3*4;1*5,2*5,3*5;1*6,2*6,3*6]));% 若只有一个all则对应行比较
true = 1<2;% 逻辑判断
false = ~1<2;% ~非
%% 基础矩阵+矩阵算法
G = ones(3,4,5);% 生成三维全一数组，三行四列五组
h = zeros(3);% 生成全零方阵，三行三列
H = eye(3);%生成单位矩阵
i = inv([1 2;3 4]);% 矩阵求逆，只能对方阵操作
I = size([1 2;3 4],1);% 求矩阵有几行
j = length([1 2 3 4]);% 求矩阵有几列
J = max([1 2 3]);% 获得最大值
k = min([1 2 3]);% 获得最小值
K = sort([2 1 3]);% 按大小进行排序
l = diff([1 2 5 6]);% 差分运算，类似于求导
% plot([1 2.5 3],[5 6 4]);% 画图，点(1,5),(2.5,6),(3,4)，并相连
%% 变量类型转换
L = 123456;
m = num2str(L);
M = m;
n = str2double(M);
N = 1;
%% 逻辑
switch(N)
    case 1
        o = 'one';
    case 2
        o = 'two';
    case 3
        o = 'three';
    otherwise
        o = 'error';
end
sum0 = 0;
for O = [0,1,2,3,4,5,6,7,8,9]
    sum0 = sum0+O;
end
P = 0;
sum1 = 0;
while P<10
    sum1 = sum1+P;
    P = P+1;
end
%% 清除命令行窗口
clc